app/views/home/home.html.haml

SELECT  "institutions".* FROM "institutions" WHERE "institutions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  - if current_user.has_role?("institution-admin")
    - if current_user.institution.users_awaiting_approval.count > 0